#include<iostream>
#include"check.h"

using namespace std;

int firstMenu() {
	int a;

	do {
		system("cls");
		cout << "--------------------------" << endl;
		cout << "|     Начальное меню     |" << endl;
		cout << "|------------------------|" << endl;
		cout << "| 1 | ВОЙТИ              |" << endl;
		cout << "|---|--------------------|" << endl;
		cout << "| 2 | ЗАРЕГИСТРИРОВАТЬСЯ |" << endl;
		cout << "|---|--------------------|" << endl;
		cout << "| 0 | ВЫЙТИ              |" << endl;
		cout << "|---|--------------------|" << endl;
		cout << "|>>>| Введите: ";
		check_input(a);
	} while (!(a >= 0 and a <= 2));

	return a;
}
int menuForAdmin() {
	system("cls");
	cout << "----------------------------------------" << endl;
	cout << "|         Меню Администратора          |" << endl;
	cout << "|--------------------------------------|" << endl;
	cout << "| 1 | Просмотреть все учётные записи   |" << endl;
	cout << "|---|----------------------------------|" << endl;
	cout << "| 2 | Управление доступом аккаунтов    |" << endl;
	cout << "|---|----------------------------------|" << endl;
	cout << "| 3 | Редактировать учётную запись     |" << endl;
	cout << "|---|----------------------------------|" << endl;
	cout << "| 4 | Добавить учётную запись          |" << endl;
	cout << "|---|----------------------------------|" << endl;
	cout << "| 5 | Удалить учётную запись           |" << endl;
	cout << "|---|----------------------------------|" << endl;
	cout << "| 6 | Создать группу студентов         |" << endl;
	cout << "|---|----------------------------------|" << endl;
	cout << "| 7 | Удалить группу студентов         |" << endl;
	cout << "|---|----------------------------------|" << endl;
	cout << "| 0 | ВЫЙТИ                            |" << endl;
	cout << "|---|----------------------------------|" << endl;
	cout << "|>>>| Введите: ";
	
	int choose;

	do {
		check_input(choose);
	} while (!(choose >= 0 and choose <= 7));

	return choose;
}
int menuOfDelete() {
	int a;
	do {
		system("cls");
		cout << "----------------------------" << endl;
		cout << "|         Удаление         |" << endl;
		cout << "|--------------------------|" << endl;
		cout << "| 1 | НАЙТИ ПО ЛОГИНУ      |" << endl;
		cout << "|---|----------------------|" << endl;
		cout << "| 2 | НАЙТИ ПО НОМЕРУ      |" << endl;
		cout << "|---|----------------------|" << endl;
		cout << "| 0 | ВЫЙТИ                |" << endl;
		cout << "|---|----------------------|" << endl;
		cout << "|>>>| Введите: ";

		check_input(a);
	} while (!(a >= 0 and a <= 2));

	return a;
}
int menuForTeacher() {
	system("cls");
	cout << "----------------------------------------------\n";
	cout << "|               Меню Учителя                 |" << endl;
	cout << "|--------------------------------------------|" << endl;
	cout << "| 1 | Журнал                                 |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "| 2 | Редактировать свой аккаунт             |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "| 0 | ВЫЙТИ                                  |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "|>>>| Введите: ";


	int choose;

	do {
		check_input(choose);
	} while (!(choose >= 0 and choose <= 2));

	return choose;
}
int menuForJournal() {
	cout << "----------------------------------------------" << endl;
	cout << "| 1 | Добавить нового студента               |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "| 2 | Удалить студента                       |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "| 3 | Выставить отметки/зачёты               |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "| 4 | Вывести по успеваемости                |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "| 5 | Вывести по алфавиту                    |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "| 6 | Редактировать данные о студенте        |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "| 7 | Вывести должников                      |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "| 8 | Отсортировать по долгам                |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "| 0 | ВЫЙТИ                                  |" << endl;
	cout << "|---|----------------------------------------|" << endl;
	cout << "|>>>| Введите: ";

	int choose;

	do {
		check_input(choose);
	} while (!(choose >= 0 and choose <= 8));

	return choose;
}
int menuForPupil() {
	system("cls");
	cout << "---------------------------------------------\n";
	cout << "|              Меню Ученика                 |" << endl;
	cout << "|-------------------------------------------|" << endl;
	cout << "| 1 | Просмотреть оценки/зачёты             |" << endl;
	cout << "|---|---------------------------------------|\n";
	cout << "| 2 | Редактировать свои данные             |" << endl;
	cout << "|---|---------------------------------------|\n";
	cout << "| 0 | ВЫЙТИ                                 |" << endl;
	cout << "|---|---------------------------------------|" << endl;
	cout << "|>>>| Введите: ";

	int choose;

	do {
		check_input(choose);
	} while (!(choose >= 0 and choose <= 2));

	return choose;
}
int menuForMarks() {
	cout << "----------------------------\n";
	cout << "|Выберите предмет:         |\n";
	cout << "|--------------------------|\n";
	cout << "| 1 | Физика               |\n";
	cout << "|---|----------------------|\n";
	cout << "| 2 | Математика           |\n";
	cout << "|---|----------------------|\n";
	cout << "| 3 | Программирование     |\n";
	cout << "|---|----------------------|\n";
	cout << "| 4 | Иностранный язык     |\n";
	cout << "|---|----------------------|\n";
	cout << "| 5 | История              |\n";
	cout << "|---|----------------------|\n";
	cout << "| 6 | Физкультура          |\n";
	cout << "|---|----------------------|\n";
	cout << "| 7 | Политология          |\n";
	cout << "|---|----------------------|\n";
	cout << "| 8 | Химия                |\n";
	cout << "|---|----------------------|\n";
	cout << "| 9 | Биология             |\n";
	cout << "|---|----------------------|\n";
	cout << "|10 | Бел.яз               |\n";
	cout << "|---|----------------------|\n";
	cout << "| 0 | ВЫЙТИ                |\n";
	cout << "|---|----------------------|\n";
	cout << "|>>>| Введите: ";

	int choose;

	do {
		check_input(choose);
	} while (!(choose >= 0 and choose <= 10));

	return choose;
}
int menuOfRedactionOfYourAccount() {
	cout << "----------------------------\n";
	cout << "|  Редактирование аккаунта |\n";
	cout << "|--------------------------|\n";
	cout << "| 1 | Логин                |\n";
	cout << "|---|----------------------|\n";
	cout << "| 2 | пороль               |\n";
	cout << "|---|----------------------|\n";
	cout << "| 3 | фамилия              |\n";
	cout << "|---|----------------------|\n";
	cout << "| 4 | имя                  |\n";
	cout << "|---|----------------------|\n";
	cout << "| 5 | Отчество             |\n";
	cout << "|---|----------------------|\n";
	cout << "| 6 | год рождения         |\n";
	cout << "|---|----------------------|\n";
	cout << "| 0 | ВЫЙТИ                |\n";
	cout << "|---|----------------------|\n";
	cout << "|>>>| Введите: ";

	int choose;

	do {
		check_input(choose);
	} while (!(choose >= 0 and choose <= 6));

	return choose;
}
int menuOfRedactionOfStudent() {
	cout << "----------------------------\n";
	cout << "|  Редактирование студента |\n";
	cout << "|--------------------------|\n";
	cout << "| 1 | фамилия              |\n";
	cout << "|---|----------------------|\n";
	cout << "| 2 | имя                  |\n";
	cout << "|---|----------------------|\n";
	cout << "| 3 | Отчество             |\n";
	cout << "|---|----------------------|\n";
	cout << "| 4 | год рождения         |\n";
	cout << "|---|----------------------|\n";
	cout << "| 0 | ВЫЙТИ                |\n";
	cout << "|---|----------------------|\n";
	cout << "|>>>| Введите: ";

	int choose;

	do {
		check_input(choose);
	} while (!(choose >= 0 and choose <= 4));

	return choose;
}
int menuOFRedactionOfAccountByAdmin() {
	cout << "----------------------------\n";
	cout << "|  Редактирование аккаунта |\n";
	cout << "|--------------------------|\n";
	cout << "| 1 | логин                |\n";
	cout << "|---|----------------------|\n";
	cout << "| 2 | пороль               |\n";
	cout << "|---|----------------------|\n";
	cout << "| 3 | номер группы         |\n";
	cout << "|---|----------------------|\n";
	cout << "| 0 | ВЫЙТИ                |\n";
	cout << "|---|----------------------|\n";
	cout << "|>>>| Введите: ";

	int choose;

	do {
		check_input(choose);
	} while (!(choose >= 0 and choose <= 3));

	return choose;
}
int findByNumberOrByLogin() {
	cout << "----------------------------\n";
	cout << "|     Найти аккаунт по     |\n";
	cout << "|--------------------------|\n";
	cout << "| 1 | логину               |\n";
	cout << "|---|----------------------|\n";
	cout << "| 2 | номеру               |\n";
	cout << "|---|----------------------|\n";
	cout << "| 0 | ВЫЙТИ                |\n";
	cout << "|---|----------------------|\n";
	cout << "|>>>| Введите: ";

	int choose;

	do {
		check_input(choose);
	} while (!(choose >= 0 and choose <= 2));

	return choose;
}